In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn import datasets
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import Binarizer

In [2]:
data = pd.read_excel("height.xlsx")
data

    names   age
0     ali    -2
1   ahmed    -1
2   akram     0
3   abdul     4
4    amna     4
5    azha     5
6    alia     5
7   arham     6
8   akash     7
9   adeel     8
10   aksa   900
11   azka  1000

In [3]:
data.age.describe()

count      12.000000
mean      161.333333
std       369.015233
min        -2.000000
25%         3.000000
50%         5.000000
75%         7.250000
max      1000.000000
Name: age, dtype: float64

In [4]:
Q1 = data.age.quantile(0.25)
Q3 = data.age.quantile(0.75)
Q1,Q3

(3.0, 7.25)

In [5]:
IQR = Q3-Q1
IQR

4.25

In [6]:
lowerlimit = Q1 - 1.5*IQR
upperlimit = Q3 + 1.5*IQR
lowerlimit , upperlimit

(-3.375, 13.625)

In [7]:
data[(data.age<lowerlimit)|(data.age>upperlimit)]

   names   age
10  aksa   900
11  azka  1000